### Short Description:
This dataset contains monthly mean_temp of Hanford from **1945 Jan** to **2017 Feb**.
Each row is a observation of the mean_temp and each date is the middle of that month.

steps:
> Change **midMonth** to **datetime**

> rename **midMonth** to **date**

> convert **month** to **numeric**

> add columns to represent the data's Continent, Country and City

> add latitude and longtitude of the location

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./Datasets/DataWorld/Hanford-station-data/HanfordMonthly.csv')

In [4]:
df.head(3)

     midMonth  year month  meanTemp
0  1945-01-15  1945   Jan      33.7
1  1945-02-15  1945   Feb      38.8
2  1945-03-15  1945   Mar      42.2

In [14]:
df.dtypes

midMonth    datetime64[ns]
year                 int64
month               object
meanTemp           float64
dtype: object

In [17]:
# convert midMonth to datetime
df['midMonth'] = pd.to_datetime(df['midMonth'])

In [35]:
# convert month to numeric
month_map = {}
count = 1
for i in df['month'].unique():
    month_map[i] = count
    count += 1
    
df['month'] = df['month'].map(month_map)

In [38]:
# renamte midMonth to date
df.rename({'midMonth':'date'}, axis=1, inplace=True)

# renmae meanTemp to mean_temp
df.rename({'meanTemp':'mean_temp'}, axis=1, inplace=True)

In [23]:
# create 3 new column called city, country and continent
df['city'] = 'Hanford'
df['country'] = 'US'
df['continent'] = 'North America'

In [30]:
# create columns represent this weather station's latitude and longitude
df['lat'] = 46.6
df['lon'] = -119.6

In [40]:
# re-order the df
df = df[['continent','country','city','lat','lon','date','year','month','mean_temp']]

In [41]:
df.head()

,continent,country,city,lat,lon,date,year,month,mean_temp
0,North America,US,Hanford,46.6,-119.6,1945-01-15,1945,1,33.7
1,North America,US,Hanford,46.6,-119.6,1945-02-15,1945,2,38.8
2,North America,US,Hanford,46.6,-119.6,1945-03-15,1945,3,42.2
3,North America,US,Hanford,46.6,-119.6,1945-04-15,1945,4,50.3
4,North America,US,Hanford,46.6,-119.6,1945-05-15,1945,5,61.7

In [43]:
# df.to_csv('hanfordmonthly-cleaned.csv')